# YOLOv8-ShuffleNetv2 summary: 223 layers, 1859264 parameters, 1859248 gradients, 5.7 GFLOPs
# YOLOv8-ShuffleNetv2 summary: 223 layers, 1859264 parameters, 1859248 gradients, 5.7 GFLOPs
# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://blog.csdn.net/weixin_43694096

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, CBRM, [32]] # 0-P2/4
  - [-1, 1, Shuffle_Block, [128, 2]] # 1-P3/8
  - [-1, 3, Shuffle_Block, [128, 1]] # 2
  - [-1, 1, Shuffle_Block, [256, 2]] # 3-P4/16
  - [-1, 7, Shuffle_Block, [256, 1]] # 4
  - [-1, 1, Shuffle_Block, [512, 2]] # 5-P5/32
  - [-1, 3, Shuffle_Block, [512, 1]] # 6

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 12 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 15 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 6], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 18 (P5/32-large)

  - [[12, 15, 18], 1, Pose, [nc, kpt_shape]] # Detect(P3, P4, P5)
