# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://blog.csdn.net/weixin_43694096

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2, 1]] # 0-P1/2  ch_out, kernel, stride, padding, groups
  - [-1, 1, G_bneck, [16, 16, 3, 1]] # 1  ch_out, ch_mid, dw-kernel, stride

  - [-1, 1, G_bneck, [24, 48, 3, 2]] # 2-P2/4
  - [-1, 1, G_bneck, [24, 72, 3, 1]] # 3

  - [-1, 1, G_bneck, [40, 72, 3, 2, True]] # 4-P3/8
  - [-1, 1, G_bneck, [40, 120, 3, 1, True]] # 5

  - [-1, 1, G_bneck, [80, 240, 3, 2]] # 6-P4/16
  - [-1, 3, G_bneck, [80, 184, 3, 1]] # 7
  - [-1, 1, G_bneck, [112, 480, 3, 1, True]]
  - [-1, 1, G_bneck, [112, 480, 3, 1, True]]

  - [-1, 1, G_bneck, [160, 672, 3, 2, True]] # 10-P5/32
  - [-1, 1, G_bneck, [160, 960, 3, 1]] # 11
  - [-1, 1, G_bneck, [160, 960, 3, 1, True]]
  - [-1, 1, G_bneck, [160, 960, 3, 1]]
  - [-1, 1, G_bneck, [160, 960, 3, 1, True]]
  - [-1, 1, Conv, [960]] # 15

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 21 (P3/8-small)

  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)

  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 27 (P5/32-large)

  - [[21, 24, 27], 1, Pose, [nc, kpt_shape]] # Detect(P3, P4, P5)
