# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://blog.csdn.net/weixin_43694096

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DRepConv, [40, 11]] # 0-P2/4
  - [-1, 1, Conv, [40, 3, 2]] # 1-P2/4
  - [-1, 1, DRepConv, [80, 11]] # 2-P3/8
  - [-1, 1, Conv, [80, 3, 2]] # 3-P3/8
  - [-1, 1, DRepConv, [160, 11]] # 4-P4/16
  - [-1, 1, Conv, [160, 3, 2]] # 5-P4/16
  - [-1, 1, DRepConv, [320, 11]] # 6-P5/32
  - [-1, 1, SPPF, [320, 5]] # 7

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [320]] # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [320]] # 13 (P3/8-small)

  - [-1, 1, Conv, [160, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [320]] # 16 (P4/16-medium)

  - [-1, 1, Conv, [320, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [512]] # 19 (P5/32-large)

  - [[13, 16, 19], 1, Segment, [nc, 32, 256]] # Detect(P3, P4, P5)
