# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNeXt_Stem, [96, 4, 4]]
  - [-1, 3, ConvNeXt_Block, [96]]
  - [-1, 1, ConvNeXt_Downsample, [192, 2, 2]]
  - [-1, 3, ConvNeXt_Block, [192]]
  - [-1, 1, ConvNeXt_Downsample, [384, 2, 2]]
  - [-1, 27, ConvNeXt_Block, [384]]
  - [-1, 1, ConvNeXt_Downsample, [768, 2, 2]]
  - [-1, 3, ConvNeXt_Block, [768]]

# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
